src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ГрафикиОтпусков</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПревышениеДнейОтпуска</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаАнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СформироватьНаСервере(ДГантаОтпусков);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СформироватьНаСервере(ДанныеГрафика)
	ДанныеГрафика.Обновление = ложь;
	ДанныеГрафика.Очистить();
	
	ЗаполнитьДанныеГрафикаОтпусков(ДанныеГрафика);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеГрафикаОтпусков(ДГантаОтпусков)
	
	Пусто = Ложь;
	Если ЗначениеЗаполнено(Параметры.АдресВХ) Тогда
		АдресВХ = Параметры.АдресВХ;
		ДанныеГрафика = ПолучитьИзВременногоХранилища(АдресВХ);
		Серия = ДГантаОтпусков.УстановитьСерию("Отпуска");
	Иначе Пусто = Истина;
	КонецЕсли;
	Если НЕ Пусто Тогда
		Для Каждого Запись Из ДанныеГрафика Цикл
			Сотрудник = Запись.Сотрудник;
			ДатаНачала = Запись.ДатаНачала;
			ДатаОкончания = Запись.ДатаОкончания;
			Точка = ДГантаОтпусков.УстановитьТочку(Сотрудник);
			Значение = ДГантаОтпусков.ПолучитьЗначение(Точка, Серия);
			Интервал = Значение.Добавить();
			Интервал.Начало = ДатаНачала;
			Интервал.Конец = ДатаОкончания;
		КонецЦикла;                    
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
